ActionObjectAssociationType
DebuggingActionName
DeviceDriverActionName
DirectoryActionName
DiskActionName
DNSActionName
FileActionName
FTPActionName
GUIActionName
HookingActionName
HTTPActionName
IPCActionName
IRCActionName
LibraryActionName
NetworkActionName
NetworkShareActionName
ProcessActionName
ProcessMemoryActionName
ProcessThreadActionName
RegistryActionName
ServiceActionName
SocketActionName
SynchronizationActionName
SystemActionName
UserActionName
ImportanceType
MalwareEntityType
CapabilityObjectiveRelationshipType
CommonCapabilityProperties
MalwareCapability
MalwareLabel
AntiBehavioralAnalysisProperties
AntiBehavioralAnalysisStrategicObjectives
AntiBehavioralAnalysisTacticalObjectives
AntiCodeAnalysisStrategicObjective
AntiCodeAnalysisTacticalObjective
AntiDetectionStrategicObjectives
AntiDetectionTacticalObjectives
AntiRemovalStrategicObjectives
AntiRemovalTacticalObjectives
AvailabilityViolationProperties
AvailabilityViolationStrategicObjectives
AvailabilityViolationTacticalObjectives
CommandandControlProperties
CommandandControlStrategicObjectives
CommandandControlTacticalObjectives
DataExfiltrationProperties
DataExfiltrationStrategicObjectives
DataExfiltrationTacticalObjectives
DataTheftProperties
DataTheftStrategicObjectives
DataTheftTacticalObjectives
DestructionProperties
DestructionStrategicObjectives
DestructionTacticalObjectives
FraudStrategicObjectives
FraudTacticalObjectives
InfectionPropagationProperties
InfectionPropagationStrategicObjectives
InfectionPropagationTacticalObjectives
IntegrityViolationStrategicObjectives
IntegrityViolationTacticalObjectives
MachineAccessControlProperties
MachineAccessControlStrategicObjectives
MachineAccessControlTacticalObjectives
PersistenceProperties
PersistenceStrategicObjectives
PersistenceTacticalObjectives
PrivilegeEscalationProperties
PrivilegeEscalationStrategicObjectives
PrivilegeEscalationTacticalObjectives
ProbingStrategicObjectives
ProbingTacticalObjectives
RemoteMachineManipulationStrategicObjectives
RemoteMachineManipulationTacticalObjectives
SecondaryOperationProperties
SecondaryOperationStrategicObjectives
SecondaryOperationTacticalObjectives
SecurityDegradationProperties
SecurityDegradationStrategicObjectives
SecurityDegradationTacticalObjectives
SpyingStrategicObjectives
SpyingTacticalObjectives
MalwareConfigurationParameter
MalwareDevelopmentTool
MalwareSubjectRelationshipType
GroupingRelationshipType
